source/_static/diagrams/recipe-reader.d2
direction: right
eb: .eb file
eval: evaluate
block: easyblock
tc: toolchain
mod: module
eb -> eval -> block -> tc -> mod
